/*
   Localizable.strings - Czech
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Ano";
"No" = "Ne";
"Ok" = "OK";
"Cancel" = "Zrušit";
"Close" = "Zavřít";
"Save" = "Uložit";
"Delete" = "Smazat";
"Rename" = "Přejmenovat";
"Extract" = "Rozbalit";
"Cut" = "Vyjmout";
"Paste" = "Vložit";
"Create" = "Vytvořit";
"Reset" = "Obnovit";

/* Common States */
"Loading" = "Načítání";
"Extracting" = "Rozbalování";
"Seeking" = "Vyhledávání";
"Seeking %d%%" = "Vyhledávání %d%%";
"Refreshing" = "Obnovování";
"Browsing" = "Procházení";
"Cancelling..." = "Rušení...";

/* Common Messages */
"Error" = "Chyba";
"OK" = "OK";
"Warning" = "Varování";
"Do you want to reset to default value:\n" = "Chcete obnovit výchozí hodnotu:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Místní procházení";
"Browser_LocalBrowsing_SubKey" = "Procházet, přehrávat a mazat místní soubory.";

"Browser_MODLAND_MainKey" = "Kolekce MODLAND";
"Browser_MODLAND_SubKey" = "%d souborů ke stažení.";

"Browser_HVSC_MainKey" = "Kolekce HVSC";
"Browser_HVSC_SubKey" = "%d souborů ke stažení.";

"Browser_Playlists_MainKey" = "Playlisty";
"Browser_Playlists_SubKey" = "Organizovat, vytvářet, mazat a poslouchat.";

"Browser_Favorites_MainKey" = "Oblíbené";
"Browser_Favorites_SubKey" = "Poslouchat ohodnocené skladby.";

"Browser_Most_played_MainKey" = "Nejhranější";
"Browser_Most_played_SubKey" = "Poslouchat nejhranější skladby.";

"Browser_Web_MainKey" = "Web";
"Browser_Web_SubKey" = "Procházet internet a stahovat hudbu.";

"Browser_WorldCharts_MainKey" = "Světové žebříčky";
"Browser_WorldCharts_SubKey" = "Nejlepší seznamy a odkazy ke stažení.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Hudba z videoher";

"Browser_UserGuide_MainKey" = "Uživatelská příručka";
"Browser_UserGuide_SubKey" = "Manuál, FAQ, tipy.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Získat všechny chybějící položky";
"GetAllEntries_SubKey" = "Omezeno na prvních 256 chybějících položek.";

"DisplayAll_MainKey" = "Seznam všech seřazených podle názvu";
"DisplayAll_SubKey" = "Aktuální adresář:";

"DisplayDir_MainKey" = "Seznam/Adresář";
"DisplayDir_SubKey" = "Všechny seřazené podle cesty:";

"DisplayAllPath_MainKey" = "Seznam všech seřazených podle cesty";
"DisplayAllPath_SubKey" = "Všechny seřazené podle názvu:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formáty/Interpreti/Soubory";
"Artists/Formats/Files" = "Interpreti/Formáty/Soubory";
"Artists/Files" = "Interpreti/Soubory";
"Formats: %d entries." = "Formáty: %d položek.";
"Artists: %d entries." = "Interpreti: %d položek.";

/* Browser Stats */
"Played %d times." = "Přehráno %d krát.";
"Played once." = "Přehráno jednou.";
"Never played." = "Nikdy nepřehráno.";
"%d files." = "%d souborů.";
"1 file." = "1 soubor.";
"Size: %dKB" = "Velikost: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Příliš mnoho položek, nelze alokovat paměť.";
"Browser not enough mem. Limited." = "Příliš mnoho položek, nelze alokovat paměť. Seznam je neúplný.";

/* File Operations */
"New folder" = "Nová složka";
"Enter folder name" = "Zadejte název složky";
"Nothing to paste" = "Nic ke vložení";
"No file to extract or not supported archive format.\n" = "Žádný soubor k rozbalení nebo nepodporovaný formát archivu.\n";
"Cannot use iCloud as folder name" = "Nelze použít iCloud jako název složky";

"Issue %d while trying to delete entry.\n%@" = "Problém %d při pokusu o smazání položky.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problém %d při pokusu o přejmenování souboru.\n%@";
"Issue %d while moving: %@.\n%@" = "Problém %d při přesunu: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problém %d při vytváření složky\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Soubor není k dispozici lokálně.\nSpouštím stahování z iCloud, zkontrolujte v aplikaci 'Soubory'.";

"unavailable" = "nedostupné";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Playlist (%d)";
"Playlist/Search off" = "Playlist/Hledání vypnuto";

"Local (%d, limited to %d)" = "Místní (%d, omezeno na %d)";
"Local (%d)" = "Místní (%d)";
"Local/Search off" = "Místní/Hledání vypnuto";

"Modland (%d, limited to %d)" = "Modland (%d, omezeno na %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Hledání vypnuto";

"HVSC (%d, limited to %d)" = "HVSC (%d, omezeno na %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Hledání vypnuto";

"ASMA (%d, limited to %d)" = "ASMA (%d, omezeno na %d)";
"ASMA (%d)" = "ASMA (%d)";
"ASMA/Search off" = "ASMA/Hledání vypnuto";

/* Search Messages */
"Searching Playlists..." = "Hledání v playlistech...";
"Searching Local files..." = "Hledání v místních souborech...";
"Searching MODLAND..." = "Hledání v MODLAND...";
"Searching HVSC..." = "Hledání v HVSC...";

"Please enter at least 2 characters for your search." = "Zadejte prosím alespoň 2 znaky pro vyhledávání.";
"Please activate at least 1 section for your search." = "Aktivujte prosím alespoň 1 sekci pro vyhledávání.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Nyní hraje";
"Now playing(%d)" = "Nyní hraje(%d)";
"Most played" = "Nejhranější";
"Favorites" = "Oblíbené";
"Resuming last\nplayed file" = "Pokračování posledního\npřehrávaného souboru";

/* Player Controls */
"Previous" = "Předchozí";
"Previous file" = "Předchozí soubor";
"Next file" = "Další soubor";
"Next" = "Další";
"Shuffle" = "Náhodně";
"Voices control" = "Ovládání hlasů";
"All voices" = "Všechny hlasy";
"Clear 'Now Playing' queue" = "Vymazat frontu 'Nyní hraje'";

/* Song Selection */
"Choose a subsong" = "Vyberte podskládbu";
"Choose a song" = "Vyberte skladbu";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Momentálně nic nehraje. Vyberte prosím soubor.";
"File cannot be played. Skipping to next playable file." = "Soubor nelze přehrát. Přeskakování na další přehratelný soubor.";
"Too much entries! Playlist will be limited to %d first entries." = "Příliš mnoho položek! Playlist bude omezen na prvních %d položek.";
"Playlist is full. Delete some entries to add more." = "Playlist je plný. Smažte některé položky pro přidání dalších.";

/* Metadata */
"unknown_title" = "Neznámý název";
"unknown_album" = "Neznámé album";
"now_playing_format" = "Přehrávání: %@ z %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Nový playlist";
"Create new playlist" = "Vytvořit nový playlist";
"Save current one" = "Uložit aktuální";
"Rename playlist" = "Přejmenovat playlist";
"Add to a playlist" = "Přidat do playlistu";
"Choose a playlist" = "Vyberte playlist";

/* Playlist Descriptions */
"Create a new empty playlist." = "Vytvořit nový prázdný playlist.";
"Create a playlist from currently played files." = "Vytvořit playlist ze současně přehrávaných souborů.";
"Browse files" = "Procházet soubory";
"Add or remove entries from browser." = "Přidat nebo odebrat položky z prohlížeče.";
"Choose a new name." = "Vyberte nový název.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Opravdu chcete smazat tento playlist?";
"Are you sure you want to delete this entry ?" = "Opravdu chcete smazat tuto položku?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Stahování";
"Download queue: 1 file" = "Fronta stahování: 1 soubor";
"Download queue: %d files" = "Fronta stahování: %d souborů";
"No download in progress" = "Žádné stahování neprobíhá";
"Downloaded %@" = "Staženo %@";
"Downloading %@" = "Stahování %@";
"Cannot download from this URL." = "Nelze stáhnout z této URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Nelze přidat soubory. Zkontrolujte prosím ručně v prohlížeči souborů (Místní procházení/Stahování).";
"File already available locally. Do you want to download it again?" = "Soubor je již dostupný lokálně. Chcete ho stáhnout znovu?";
"URL have to start with ftp:// or http://" = "URL musí začínat na ftp:// nebo http://";
"Cannot connect to FTP." = "Nelze se připojit k FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Databáze vytvořena.";
"Database will now be recreated. Please validate & wait." = "Databáze bude nyní znovu vytvořena. Potvrďte a počkejte.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Špatná verze databáze: %d.%d. Bude aktualizována na %d.%d. Potvrďte a počkejte.";
"No database found. Will create a new one. Please validate & wait..." = "Databáze nenalezena. Bude vytvořena nová. Potvrďte a počkejte...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Obrázek detekován";
"Choose_SaveCover" = "Uložit obrázek jako obal pro %@?";
"CoverFolder" = "Jako obal složky";
"CoverFile" = "Jako obal souboru";
"Confirm_RemCurCovers" = "Odstranit aktuální obaly pro %@ (složka a soubor)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Obecné";
"Settings_Player" = "Přehrávač";
"Settings_Display" = "Zobrazení";
"Settings_Download" = "Stahování";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Knihovny přehrávání";
"Settings_Settings" = "Nastavení";

/* Settings Presets */
"Settings_SettingsDefault" = "Výchozí";
"Settings_SettingsHigh" = "Vysoká";
"Settings_SettingsMed" = "Střední";
"Settings_SettingsLow" = "Nízká";

"Confirm_SettingsDef" = "Opravdu chcete obnovit nastavení s 'výchozími' hodnotami?";
"Confirm_SettingsHigh" = "Opravdu chcete obnovit nastavení s 'vysokými' hodnotami?";
"Confirm_SettingsMed" = "Opravdu chcete obnovit nastavení se 'středními' hodnotami?";
"Confirm_SettingsLow" = "Opravdu chcete obnovit nastavení s 'nízkými' hodnotami?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Hledání: zjednodušený regexp ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Pokračovat v pozici při spuštění";
"Notification" = "Oznámení";
"Notification duration" = "Doba trvání oznámení";
"Disable screen auto lock" = "Zakázat automatické zamykání obrazovky";
"No screen auto lock" = "Bez automatického zamykání obrazovky";
"Enable playback ratio" = "Povolit poměr přehrávání";
"Playback ratio" = "Poměr přehrávání";
"Default length" = "Výchozí délka";
"Default length %d:%.2d" = "Výchozí délka %d:%.2d";
"Fade-out time" = "Čas postupného zeslabení";
"Silence Detection" = "Detekce ticha";
"Stop song if silent for more than selected number of seconds. 0: off" = "Zastavit skladbu, pokud je ticho déle než vybraný počet sekund. 0: vypnuto";
"Will skip song if nothing is played for specified duration (0=off)" = "Přeskočí skladbu, pokud nic nehraje po určitou dobu (0=vypnuto)";
"Force mono" = "Vynutit mono";
"Panning" = "Panoráma";
"Panning value" = "Hodnota panorámy";
"Audio latency" = "Latence zvuku";
"Audio latency in ms" = "Latence zvuku v ms";
"Multi default action" = "Výchozí akce pro více souborů";
"Browse" = "Procházet";
"Archive/multi play mode" = "Režim přehrávání archivu/více souborů";
"Entry" = "Položka";

/* Archive Settings */
"Archive multi default action" = "Výchozí akce pro archiv s více soubory";
"Archive multi play mode" = "Režim přehrávání archivu s více soubory";

/* Playlist Settings */
"Play/Enqueue action" = "Akce přehrát/zařadit";
"Enqueue mode" = "Režim zařazení do fronty";
"Default Action" = "Výchozí akce";
"Play" = "Přehrát";
"Enqueue" = "Zařadit";
"Enq.&Play" = "Zařadit a přehrát";
"First" = "První";
"Current" = "Aktuální";
"Last" = "Poslední";
"Enqueue position" = "Pozice zařazení";
"Post download action" = "Akce po stažení";
"Nothing" = "Nic";

/* Display Settings */
"Background mode" = "Režim na pozadí";
"Partial" = "Částečný";
"Full" = "Úplný";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Vypnuto=žádný proces na pozadí, Částečné=pokračovat v přehrávání hudby, Plné=ponechat aplikaci na pozadí";
"Long name truncate" = "Zkrácení dlouhých názvů";
"Head" = "Začátek";
"Mid." = "Střed";
"Tail" = "Konec";
"Filename as title" = "Název souboru jako titul";

/* Local Files Settings */
"Auto. restore Samples folder" = "Automaticky obnovit složku Samples";
"Send statistics" = "Posílat statistiky";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Databáze";
"Settings_CleanDB" = "Vyčistit databázi";
"Settings_ResetPlCnt" = "Obnovit počítadla přehrání";
"Settings_ResetRatings" = "Obnovit hodnocení";
"Settings_ResetDB" = "Obnovit celou databázi";

"Confirm_DBClean" = "Spustit čištění databáze (může chvíli trvat)?";
"Confirm_Reset_PlCnt" = "Opravdu chcete obnovit všechna počítadla přehrání?";
"Confirm_Reset_Ratings" = "Opravdu chcete obnovit všechna hodnocení?";
"Confirm_ResetDB" = "Opravdu chcete obnovit celou databázi? Playlisty, hodnocení, počítadla budou smazány.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Místní soubory";
"Settings_RecreateSamples" = "Znovu vytvořit složku 'Samples'";
"Settings_FormatDownloads" = "Formátovat složku 'Downloads'";
"Settings_RemCovers" = "Odstranit obaly";
"Settings_UpdateFilesBackupFlag" = "Zkontrolovat souborový systém";

"Confirm_RecreateSamples" = "Chcete znovu vytvořit složku 'Samples'?";
"Confirm_FormatDownloads" = "Chcete odstranit VŠECHNY soubory ze složky Místní procházení/Web?";
"Confirm_CheckFiles" = "Chcete provést kontrolu místního souborového systému?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Typ OPL";
"Stereo surround" = "Stereo prostorový";

/* GBSPlay */
"HP filter type" = "Typ HP filtru";
"Highpass filter type" = "Typ horní propust filtru";

/* Game Music Emu (GME) */
"Stereo separation" = "Stereo separace";
"Ignore silence" = "Ignorovat ticho";
"Silence detection" = "Detekce ticha";
"Equalizer" = "Ekvalizér";
"Bass" = "Basy";
"Treble" = "Výšky";

/* GSF */
"Sound quality" = "Kvalita zvuku";
"Interpolation" = "Interpolace";
"Low-pass filter" = "Dolní propust filtr";
"Echo" = "Echo";

/* Highly Complete (HC) */
"Resample quality" = "Kvalita převzorkování";
"Main enabled" = "Hlavní povoleno";
"Reverb enabled" = "Reverb povolen";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY výchozí délka";
"LPF strength" = "Síla LPF";
"Min=off, default: 112" = "Min=vypnuto, výchozí: 112";
"HPF strength" = "Síla HPF";
"Region" = "Oblast";
"VRC7 Patches" = "VRC7 záplaty";
"Force IRQ" = "Vynutit IRQ";
"Quality" = "Kvalita";

/* OpenMPT */
"Master volume" = "Hlavní hlasitost";
"Sampling" = "Vzorkování";
"Resampling" = "Převzorkování";

/* SID */
"Engine" = "Motor";
"Filter" = "Filtr";
"Force loop" = "Vynutit smyčku";
"Clock" = "Hodiny";
"Model" = "Model";
"Force 2nd SID" = "Vynutit 2. SID";
"Address 2nd" = "Adresa 2.";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF nebo 0xDE00-0xDFFF";
"Force 3rd SID" = "Vynutit 3. SID";
"Address 3rd" = "Adresa 3.";

/* Timidity */
"Max loop" = "Maximální smyčka";
"MIDI polyphony" = "MIDI polyfonie";
"Amplification" = "Zesílení";
"Chorus" = "Sbor";
"Reverb" = "Reverb";
"Resample" = "Převzorkování";
"LP filter" = "LP filtr";

/* UADE */
"Headphones" = "Sluchátka";
"LED filter" = "LED filtr";
"Normalization" = "Normalizace";
"Post FX" = "Post FX";
"Panning" = "Panoráma";
"Panning value" = "Hodnota panorámy";
"Gain" = "Zesílení";
"Gain value" = "Hodnota zesílení";
"Force NTSC" = "Vynutit NTSC";

/* VGMPlay */
"Prefer JTAG" = "Upřednostnit JTAG";
"YM2612 emulator" = "YM2612 emulator";
"Nuked OPN2 option" = "Nuked OPN2 option";
"YMF262 emulator" = "YMF262 emulator";
"YM3812 emulator" = "YM3812 emulator";
"QSound emulator" = "QSound emulator";
"RF5C68 emulator" = "RF5C68 emulator";

/* VGMStream */
"Max loop" = "Maximální smyčka";

/* XMP */
"Amiga 500 Filter" = "Amiga 500 Filter";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "FX průhlednost";
"FX Fullscreen" = "FX celá obrazovka";
"FX FPS" = "FX snímků/s";
"FX show info" = "FX zobrazit info";
"Tech Info" = "Technické informace";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Zobrazit FPS a další info (CPU, rozlišení, ProjectM audio data)";
"FX Level of details" = "FX úroveň detailů";
"Low" = "Nízká";
"Med" = "Střední";
"High" = "Vysoká";
"Slow FX limit" = "Limit pomalých FX";
"Deactivate FX if too slow." = "Deaktivovat FX, pokud jsou příliš pomalé.";
"Weak" = "Slabý";
"Strong" = "Silný";
"Display song info" = "Zobrazit info o skladbě";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "V režimu celé obrazovky zobrazit info o skladbě při změně. TL je vlevo nahoře, DR je vpravo dole, C je střed.";

/* ProjectM */
"ProjectM settings" = "Nastavení ProjectM";
"ProjectM on/off" = "ProjectM zap/vyp";
"Show preset label" = "Zobrazit popisek předvolby";
"Auto switch presets mode" = "Režim automatického přepínání předvoleb";
"Lock preset" = "Uzamknout předvolbu";
"Time between preset" = "Čas mezi předvolbami";
"Blend presets" = "Smíchat předvolby";
"Blend time" = "Čas míchání";
"Bundled presets" = "Zabudované předvolby";
"Custom presets" = "Vlastní předvolby";
"Aspect ratio" = "Poměr stran";
"Mesh size X" = "Velikost sítě X";
"Mesh size Y" = "Velikost sítě Y";
"Hard cut enabled" = "Tvrdé přechody povoleny";
"Hard cut min time" = "Min čas tvrdého přechodu";
"Hard cut sensitivity" = "Citlivost tvrdého přechodu";
"Beat sensitivity" = "Citlivost beatu";
"Permissive mode" = "Benevolentní režim";

/* Oscilloscope */
"Oscillo settings" = "Nastavení osciloskopu";
"FX mode" = "Režim FX";
"Show label" = "Zobrazit popisek";
"Label font size" = "Velikost písma popisku";
"Show grid" = "Zobrazit mřížku";
"Grid color" = "Barva mřížky";
"Line width" = "Šířka čáry";
"Mono color" = "Jedna barva";
"Multi color set" = "Více barevná sada";
"Reset all colors" = "Obnovit všechny barvy";
"Thin" = "Tenké";
"Medium" = "Střední";
"Thick" = "Tlusté";
"Beefy" = "Robustní";

/* Piano Roll / MIDI */
"Piano roll" = "Piano roll";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Aktivovat Piano roll FX, standardní nebo jako 'Synthesia'";
"Activate spark FX, colored or white" = "Aktivovat spark FX, barevný nebo bílý";
"Display voices labels" = "Zobrazit popisky hlasů";
"Display octaves labels" = "Zobrazit popisky oktáv";
"MIDI pattern" = "MIDI vzor";
"MIDI cut line" = "MIDI řezná linie";
"MIDI bar style" = "MIDI styl pruhu";
"MIDI bar vibrato" = "MIDI vibrato pruhu";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Piano řezná linie";
"Piano color mode" = "Piano barevný režim";

/* Spectrum */
"3D spectrum" = "3D spektrum";
"3D spectrum bloom" = "3D spektrum rozostření";
"Spectrum" = "Spektrum";
"3D landscape" = "3D krajina";
"3D landscape bloom" = "3D krajina rozostření";

/* MOD Pattern */
"MOD pattern" = "MOD vzor";
"MOD pattern BG alpha" = "MOD vzor průhlednost pozadí";
"MOD pattern vol bar" = "MOD vzor pruh hlasitosti";
"MOD pattern current line mode" = "MOD vzor režim aktuální řádky";
"MOD pattern font" = "MOD vzor písmo";
"MOD pattern font size" = "MOD vzor velikost písma";
"MOD pattern theme" = "MOD vzor téma";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Welcome to Modizer's web browser!</b><br><br>Use the address bar above to navigate or explore your bookmarks.<br><br>To use an image as cover, copy it in the paste board with a long press (iOS) or a right click (macOS).";
"Bookmarks" = "Záložky";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.2 © Yohann Magnien / YoyoFR\n\nContact: mailto:modizerhelp@gmail.com\nWeb: https://modizer.app\n\nModizer's logo by Steve Miele.\n\nNumber of file formats/extension supported: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nIntegrated player libs:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(using Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebSID\n- ZXTune\n\nDisclaimer:\nInternet accesses to the Modland, HVSC & ASMA libraries are provided as an as-is service, guarantee for availability and/or functionality is not given. Use this application at your own risk.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Podpora emailem";
"Contact support by email" = "Kontaktovat podporu emailem";
"[Please describe your request below]" = "[Popište prosím svůj požadavek níže]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Děkujeme! ❤️";
"Send a tip to Modizer" = "Poslat spropitné Modizeru";
"Support Modizer development" = "Podpořit vývoj Modizeru";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & 
reseting settings" = "Čištění DB a
obnovení nastavení";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "První spuštění nebo problém při posledním běhu Modizeru. Použít výchozí nastavení?";


// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Intent Titles */
"Play" = "Přehrát";
"Pause" = "Pozastavit";
"Stop" = "Zastavit";
"Next Song" = "Další skladba";
"Previous Song" = "Předchozí skladba";
"Play Subsong" = "Přehrát podskládku";
"Seek" = "Posunout";
"Set Infinite Loop" = "Nastavit nekonečnou smyčku";
"Set Loop Mode" = "Nastavit režim smyčky";
"Set Shuffle Mode" = "Nastavit režim náhodného přehrávání";
"Toggle Shuffle" = "Přepnout náhodné přehrávání";
"Toggle Loop Mode" = "Přepnout režim smyčky";
"Set Fullscreen mode" = "Nastavit režim celé obrazovky";
"Go the player view" = "Přejít do zobrazení přehrávače";
"Set FX" = "Nastavit FX";
"Get Now Playing" = "Získat aktuálně hranou skladbu";
"Get Playlists" = "Získat playlisty";
"Play some music" = "Přehrát hudbu";
"Play most played" = "Přehrát nejhranější";
"Play favorites" = "Přehrát oblíbené";
"Play Playlist" = "Přehrát playlist";
"Play Playlist By Name" = "Přehrát playlist podle jména";

/* Intent Descriptions */
"Starts playing music in Modizer." = "Spustí přehrávání hudby v Modizeru.";
"Pauses music playback in Modizer." = "Pozastaví přehrávání hudby v Modizeru.";
"Stops music playback in Modizer." = "Zastaví přehrávání hudby v Modizeru.";
"Skips to the next song in Modizer." = "Přeskočí na další skladbu v Modizeru.";
"Skips to the previous song in Modizer." = "Přeskočí na předchozí skladbu v Modizeru.";
"Plays a specific subsong in the current file." = "Přehraje konkrétní podskládku v aktuálním souboru.";
"Seeks to a specific position in the current song." = "Posune se na konkrétní pozici v aktuální skladbě.";
"Set the infinite loop mode in Modizer." = "Nastaví režim nekonečné smyčky v Modizeru.";
"Set the loop mode in Modizer." = "Nastaví režim smyčky v Modizeru.";
"Set the shuffle mode in Modizer." = "Nastaví režim náhodného přehrávání v Modizeru.";
"Toggles shuffle mode in Modizer." = "Přepne režim náhodného přehrávání v Modizeru.";
"Toggles loop mode in Modizer." = "Přepne režim smyčky v Modizeru.";
"Set Fullscreen mode on or off in Modizer." = "Zapne nebo vypne režim celé obrazovky v Modizeru.";
"Go the player view in Modizer." = "Přejde do zobrazení přehrávače v Modizeru.";
"Set FX mode in Modizer." = "Nastaví režim FX v Modizeru.";
"Gets information about the currently playing song." = "Získá informace o aktuálně hrané skladbě.";
"Gets the list of available playlists in Modizer." = "Získá seznam dostupných playlistů v Modizeru.";
"Random picks from available local titles in Modizer." = "Náhodný výběr z dostupných místních skladeb v Modizeru.";
"Most played titles from available local titles in Modizer." = "Nejhranější skladby z dostupných místních skladeb v Modizeru.";
"Favorites titles from available local titles in Modizer." = "Oblíbené skladby z dostupných místních skladeb v Modizeru.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Přehraje konkrétní playlist v Modizeru. Poznámka: Pro nejlepší výsledky s hlasovými příkazy použijte raději 'Přehrát playlist podle jména'.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Přehraje playlist podle jména v Modizeru. Doporučeno pro hlasové příkazy.";

/* Parameters */
"Subsong Index" = "Index podskládky";
"The index of the subsong to play" = "Index podskládky k přehrání";
"Position (seconds)" = "Pozice (sekundy)";
"The position to seek to in seconds" = "Pozice k posunu v sekundách";
"Relative" = "Relativní";
"Whether to seek relative to current position" = "Zda posunout relativně k aktuální pozici";
"Infinite Loop Mode" = "Režim nekonečné smyčky";
"0: off, 1: infinite loop" = "0: vypnuto, 1: nekonečná smyčka";
"Repeat Mode" = "Režim opakování";
"0: off, 1: loop current title, 2: loop playlist" = "0: vypnuto, 1: opakovat aktuální skladbu, 2: opakovat playlist";
"Shuffle Mode" = "Režim náhodného přehrávání";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: vypnuto, 1: vybrat pouze jeden název, pokud soubor má podskládky nebo je archiv, 2: přehrát všechny skladby daného souboru";
"Fullscreen mode" = "Režim celé obrazovky";
"Activate (1) or disactivate (0) Fullscreen mode" = "Aktivovat (1) nebo deaktivovat (0) režim celé obrazovky";
"FX" = "FX";
"The FX to set" = "FX k nastavení";
"FX Mode" = "Režim FX";
"The mode to activate for the selected FX (0:off)" = "Režim k aktivaci pro vybraný FX (0:vypnuto)";
"Playlist" = "Playlist";
"The playlist to play" = "Playlist k přehrání";
"Start Index" = "Počáteční index";
"The index of the song to start playing from (0-based)" = "Index skladby, od které začít přehrávání (počínaje 0)";
"Playlist Name" = "Název playlistu";
"The name of the playlist to play" = "Název playlistu k přehrání";
"Which playlist would you like to play?" = "Který playlist chcete přehrát?";

/* Dialog Messages */
"play_playlist_dialog" = "Playing playlist %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Playlist nenalezen. Použijte 'Získat Playlisty' pro zobrazení dostupných playlistů.";
"No playlists found" = "Nenalezeny žádné playlisty";

/* FX Names */
"ProjectM" = "ProjectM";
"Oscillo" = "Osciloskop";
"Piano roll" = "Piano roll";
"3D Piano" = "3D piano";
"Notes bars" = "Notové pruhy";
"Tracker" = "Tracker";
"2D Spectrum" = "2D spektrum";
"3D Spectrum" = "3D spektrum";
"3D Landscape" = "3D krajina";

// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Hlasové příkazy";
"Siri voice commands for Modizer" = "Hlasové příkazy Siri pro Modizer";
"Voice Commands: Playback" = "Přehrávání";
"Voice Commands: Navigation" = "Navigace";
"Voice Commands: Playlists" = "Playlisty";
"Voice Commands: Modes" = "Režimy";
// MARK: - TABS
// ================================

"Search" = "Hledat";
"More" = "Více";
"Suspend" = "Pozastavit";
"Clear all" = "Vymazat vše";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "O aplikaci";
"Some general informations" = "Některé obecné informace";
"Settings" = "Nastavení";
"Global, Visu, FTP & Plugins" = "Globální, vizualizace, FTP a pluginy";
"Maintenance" = "Údržba";
"Clean DB, Reset ratings, ..." = "Vyčistit DB, Obnovit hodnocení, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Kolekce";
"Browse Internet" = "Procházet internet";
"Games Music" = "Herní hudba";
"Mods & chiptunes" = "Mody a chiptunes";
"Other" = "Other";

/* Collections */
"MODLAND collection" = "Kolekce MODLAND";
"AMP collection" = "Kolekce AMP";
"HVSC collection" = "Kolekce HVSC";
"ASMA collection" = "Kolekce ASMA";
"JOSHW collection" = "Kolekce JOSHW";
"VGMRips collection" = "VGMRips collection";
"SNESmusic collection" = "SNESmusic collection";
"SMS Power! collection" = "SMS Power! collection";
"ZXArt collection" = "ZXArt collection";

/* Collection Descriptions */
"%d entries" = "%d entries";
"Thousands of entries" = "Thousands of entries";
"4K+ packs / 70K+ songs" = "4K+ balíčků / 70K+ skladeb";
"1500+ sets / Super Nintendo/Famicom" = "1500+ sets / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Master System & Game gear sets";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizer World Charts";
"Web browser" = "Web browser";
"No internet connectivity or website down." = "No internet connectivity or website down.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI  
// ================================

/* Settings Families */
"Global" = "Globální";
"Default Players" = "Výchozí přehrávače";
"Visualizers" = "Visualizers";
"PR & NS colors settings" = "PR & NS colors settings";
"Plugins" = "Plugins";

/* Player Selection */
"MOD player" = "MOD player";
"SAP player" = "SAP player";
"SID player" = "SID player";
"VGM player" = "VGM player";
"YM player" = "YM player";
"NSF player" = "NSF player";
"PT3 player" = "PT3 player";
"GBS player" = "GBS player";
"KSS player" = "KSS player";
"2SF player" = "2SF player";
"MIDI player" = "MIDI player";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, delay rounded to a multiple of audio buffer size";
"Limited: not for subsong" = "Omezeno: ne pro podskládky";
"Default value is 3s" = "Výchozí hodnota je 3s";
"Default action when selecting an archive or a multisong file" = "Default action when selecting an archive or a multisong file";
"Play only selected entry or full archive/multisong file" = "Play only selected entry or full archive/multisong file";
"Show Welcome screen" = "Show Welcome screen";
"Adplug priority for module" = "Priorita Adplug pro modul";

/* FTP Settings */
"Server status" = "Server status";
"FTP Server" = "FTP server";
"Authorize anonymous" = "Povolit anonymní";
"User" = "User";
"Password" = "Password";
"Port" = "Port";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "URL HVSC";
"ASMA URL" = "URL ASMA";
"MODLAND Server" = "MODLAND Server";
"MODLAND cust.URL" = "MODLAND cust.URL";
"HVSC Server" = "Server HVSC";
"HVSC cust.URL" = "Vlastní URL HVSC";
"ASMA Server" = "Server ASMA";
"ASMA cust.URL" = "Vlastní URL ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Patterns BG Alpha";
"Opacity of mod patterns view" = "Opacity of mod patterns view";
"MOD Color Theme" = "MOD Color Theme";
"MOD Current Line" = "MOD Current Line";
"MOD Volume bars" = "MOD Volume bars";
"MOD Pattern Font" = "MOD Pattern Font";
"MOD Pattern Font Size" = "MOD Pattern Font Size";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Piano Roll FX";
"PR/Spark FX" = "PR/Spark FX";
"Display voices label" = "Zobrazit popisek hlasů";
"Notes scroller FX" = "Notes scroller FX";
"NS/bars mode" = "NS/bars mode";
"NS/bars style" = "NS/bars style";
"Vibrato display" = "Vibrato display";
"Piano FX" = "Piano FX";
"Piano bars mode" = "Piano bars mode";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D Sp.rozostření";
"3D Land. Bloom" = "3D kraj. rozostření";
"0: off" = "0: vypnuto";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Rendering quality: Max is pixel resolution, 1/2 is half, ...";
"Custom presets/textures should be copied in .projectm folder" = "Custom presets/textures should be copied in .projectm folder";
"Display preset name" = "Zobrazit název předvolby";
"Lim: display and disappear quickly" = "Lim: display and disappear quickly";
"Auto switch presets" = "Automaticky přepínat předvolby";
"Allow loading of milk file with script issues" = "Allow loading of milk file with script issues";
"Default is 15s" = "Výchozí je 15s";
"Default is 2.7s" = "Výchozí je 2.7s";
"Default value is 32" = "Výchozí hodnota je 32";
"Default value is 24" = "Výchozí hodnota je 24";
"Default value is 20" = "Výchozí hodnota je 20";
"Hardcut" = "Tvrdý přechod";
"Hardcut triggers presets switch synchronized with beats." = "Hardcut triggers presets switch synchronized with beats.";
"Hardcut min time" = "Min čas tvrdého přechodu";
"Preserve aspect ratio for compatible shaders." = "Preserve aspect ratio for compatible shaders.";
"Default value is 1" = "Výchozí hodnota je 1";
"Hardcut sensitivity" = "Citlivost tvrdého přechodu";

/* Oscilloscope Settings */
"Oscillo FX" = "Oscillo FX";
"Oscillo show labels" = "Oscillo show labels";
"Oscillo labels font size" = "Oscillo labels font size";
"Oscillo show grid" = "Oscillo show grid";
"Oscillo line width" = "Oscillo line width";
"Reset all custom colors" = "Reset all custom colors";
"Multi color | System 1" = "Multi color | System 1";
"Multi color | System 2" = "Multi color | System 2";
"Multi color | System 3" = "Multi color | System 3";
"Multi color | System 4" = "Multi color | System 4";
"Multi color | System 5" = "Multi color | System 5";
"Multi color | System 6" = "Multi color | System 6";
"Multi color | System 7" = "Multi color | System 7";
"Multi color | System 8" = "Multi color | System 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Vlastní barva 01";
"Custom color 02" = "Vlastní barva 02";
"Custom color 03" = "Vlastní barva 03";
"Custom color 04" = "Vlastní barva 04";
"Custom color 05" = "Vlastní barva 05";
"Custom color 06" = "Vlastní barva 06";
"Custom color 07" = "Vlastní barva 07";
"Custom color 08" = "Vlastní barva 08";
"Custom color 09" = "Vlastní barva 09";
"Custom color 10" = "Vlastní barva 10";
"Custom color 11" = "Vlastní barva 11";
"Custom color 12" = "Vlastní barva 12";
"Custom color 13" = "Vlastní barva 13";
"Custom color 14" = "Vlastní barva 14";
"Custom color 15" = "Vlastní barva 15";
"Custom color 16" = "Vlastní barva 16";
"Custom color 17" = "Vlastní barva 17";
"Custom color 18" = "Vlastní barva 18";
"Custom color 19" = "Vlastní barva 19";
"Custom color 20" = "Vlastní barva 20";
"Custom color 21" = "Vlastní barva 21";
"Custom color 22" = "Vlastní barva 22";
"Custom color 23" = "Vlastní barva 23";
"Custom color 24" = "Vlastní barva 24";
"Custom color 25" = "Vlastní barva 25";
"Custom color 26" = "Vlastní barva 26";
"Custom color 27" = "Vlastní barva 27";
"Custom color 28" = "Vlastní barva 28";
"Custom color 29" = "Vlastní barva 29";
"Custom color 30" = "Vlastní barva 30";
"Custom color 31" = "Vlastní barva 31";
"Custom color 32" = "Vlastní barva 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Přeskočí skladbu, pokud nic nehraje po určitou dobu (0=vypnuto)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Výchozí délka";
"Oversampling. Min=0, default: 10" = "Oversampling. Min=0, default: 10";
"Min=off, default: 112" = "Min=vypnuto, výchozí: 112";
"Max=off, default: 164" = "Max=off, default: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Forces IRQ capability for all NSFs, not just NSF2";
"APU unmute on reset" = "APU unmute on reset";
"APU phase reset" = "APU phase reset";
"APU non linear mixing" = "APU non linear mixing";
"APU swap duty 1/2" = "APU swap duty 1/2";
"APU Initialize sweep unmute" = "APU Initialize sweep unmute";
"DMC enable $4011 writes" = "DMC enable $4011 writes";
"DMC enable periodic noise" = "DMC enable periodic noise";
"DMC unmute on reset" = "DMC unmute on reset";
"DMC anti clicking" = "DMC anti clicking";
"DMC non linear mixer" = "DMC non linear mixer";
"DMC randomize noise on reset" = "DMC randomize noise on reset";
"DMC mute triangle on pitch 0" = "DMC mute triangle on pitch 0";
"prevents high frequency aliasing" = "prevents high frequency aliasing";
"DMC rand. triangle" = "DMC rand. triangle";
"randomize triangle on reset" = "randomize triangle on reset";
"DMC reverse bits" = "DMC reverse bits";
"reverse bits of DPCM sample bytes" = "reverse bits of DPCM sample bytes";
"MMC5 non linear mixing" = "MMC5 non linear mixing";
"MMC5 Phase reset" = "MMC5 Phase reset";
"Reset phase counter after write $5003 and $5007" = "Reset phase counter after write $5003 and $5007";
"FDS LP filter in Hz" = "FDS LP filter in Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Cutoff frequency (0Hz=off, 2000Hz=default)";
"FDS reset \"phase\"" = "FDS reset \"phase\"";
"$4085 \"resets\" modular phase" = "$4085 \"resets\" modular phase";
"FDS write protect" = "FDS write protect";
"write protect $8000-DFFF" = "write protect $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 Replace with OPLL";
"N163 Serial Multiplex mixing" = "N163 Serial Multiplex mixing";
"N163 Write Protect Phase" = "N163 Write Protect Phase";
"N163 Limit Wavelength" = "N163 Limit Wavelength";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Only for HC plugin";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Hodnota panorámy";
"Gain value" = "Hodnota zesílení";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Zakázat";
"Enter playlist name" = "Zadejte název playlistu";
"Ask" = "Zeptat se";
"Play All" = "Přehrát vše";
"Single" = "Jeden";
"Archive" = "Archiv";
"On" = "Zapnuto";
"Off" = "Vypnuto";
"Lim" = "Lim";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Přidat playlist";
"Create a new playlist" = "Vytvořit nový playlist";
"Now playing" = "Nyní hraje";
"1 entry" = "1 položka";
"No entry" = "Žádná položka";
"Random picks" = "Náhodný výběr";
"Generate a randomized playlist" = "Vygenerovat náhodný playlist";
"Most played" = "Nejhranější";
"Favorites" = "Oblíbené";

/* Playlist Actions */
"Add/Remove files..." = "Přidat/Odebrat soubory...";
"More actions..." = "Další akce...";
"Save as a new playlist" = "Uložit jako nový playlist";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!
" = "Vítejte v Modizeru!
";
"Level up your library." = "Vylepšete svou knihovnu.";
"Sound meets visuals." = "Zvuk potkává vizuály.";
"Made with passion,
offered for free." = "Vytvořeno s vášní,
nabízeno zdarma.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.
Power up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Vaše brána k retro a tracker hudbě.
Vylepšete své zařízení legendárními herními melodiemi, ikonickými tracker moduly a nadčasovými chiptune klasikami.";

"Browse and stream from online catalogs, to complete your own collections.
Build, edit, and listen to playlists effortlessly." = "Procházejte a streamujte z online katalogů, abyste doplnili své vlastní sbírky.
Vytvářejte, upravujte a poslouchejte playlisty bez námahy.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Odemkněte klasický vzhled osciloskopu, spektrální pruhy, piano rolly, tracker zobrazení a ProjectM/Milkdrop FX. Nechte Modizer vykreslit každou skladbu pohybem a barvou.";

"If you enjoy the app, tips are a great way to support its ongoing development.
Thank you for helping keep Modizer alive and evolving." = "Pokud se vám aplikace líbí, spropitné je skvělý způsob, jak podpořit její další vývoj.
Děkujeme, že pomáháte udržet Modizer živý a rozvíjející se.";

"Skip" = "Přeskočit";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Podpořit spropitným";
"Enjoy Modizer ?" = "Užíváte si Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Vaše podpora pomáhá udržet Modizer v provozu a bez reklam!";
"Already tipped so far" = "Dosud přispěno";
"Thank you for your support! ❤️" = "Děkujeme za vaši podporu! ❤️";

/* Tip Tiers */
"Coffee" = "Káva";
"Coffee & Croissant" = "Káva a croissant";
"Dinner" = "Večeře";
"Loading..." = "Načítání...";

/* Tip Actions */
"Confirm Tip" = "Potvrdit spropitné";
"Send Tip" = "Poslat spropitné";
"Send a %@ tip for %@?" = "Poslat spropitné %@ za %@?";
"Tip" = "Spropitné";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Nelze načíst produkty. Zkontrolujte prosím své internetové připojení.";

/* Thank You Alert */
"Thank You! ❤️" = "Děkujeme! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Vaše podpora znamená vše! Děkujeme, že pomáháte udržet Modizer v provozu.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Vyčistit databázi";
"Clear 'Now Playing' queue" = "Vymazat frontu 'Nyní hraje'";
"Recreate Samples folder" = "Znovu vytvořit složku Samples";
"Reset settings to default" = "Obnovit nastavení na výchozí";
"Remove current cover" = "Odstranit aktuální obal";
"Reset Ratings" = "Obnovit hodnocení";
"Reset Played Counters" = "Obnovit počítadla přehrání";
"Reset Database" = "Obnovit databázi";
"Clear images cache" = "Vymazat cache obrázků";

/* Maintenance Messages */
"Settings reseted" = "Nastavení obnoveno";
"Ratings reseted" = "Hodnocení obnoveno";
"Played Counters reseted" = "Počítadla přehrání obnovena";
"Samples folder created" = "Složka Samples vytvořena";
"Cache cleaned" = "Cache vymazána";
"Database reseted" = "Databáze obnovena";
"No cover to remove" = "Žádný obal k odstranění";
"Cover removed" = "Obal odstraněn";
"Database cleaned" = "Databáze vyčištěna";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Opravdu chcete vyčistit databázi? Může to chvíli trvat.";
"Clean" = "Vyčistit";
"Cleaning DB" = "Čištění databáze";
"Cancelling..." = "Rušení...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX
window" = "Zavřít FX
okno";
"All FX off" = "Všechny FX vypnuto";
"FX
alpha" = "FX
průhlednost";
"Show name
temp." = "Zobrazit název
dočasně";
"Show name" = "Zobrazit název";
"Bundled
presets" = "Zabudované
předvolby";
"Custom
presets" = "Vlastní
předvolby";
"Blend
presets" = "Smíchat
předvolby";
"Clear
all" = "Vymazat
vše";
"Select
all" = "Vybrat
vše";
"Favorites" = "Oblíbené";
"Expand" = "Rozbalit";
"Select
listed" = "Vybrat
seznamu";
"Remove
listed" = "Odebrat
seznamu";
"Selected" = "Vybráno";
"Collapse" = "Sbalit";
"Labels" = "Popisky";
"Grid" = "Mřížka";
"Voices
labels" = "Hlasy
popisky";
"Octaves
labels" = "Oktávy
popisky";
"Volume
bars" = "Hlasitost
pruhy";
"Fixed bar" = "Pevný pruh";
"BG
opacity" = "Pozadí
průhlednost";
"Bloom:
%s" = "Rozostření:
%s";
"Thickness:
%s" = "Tloušťka:
%s";
"Font size
%s" = "Velikost písma
%s";
"Font:
%s" = "Písmo:
%s";
"Info HUD:
%s" = "Info HUD:
%s";
"Select active %s presets" = "Vybrat aktivní %s předvolby";
"bundled" = "zabudované";
"custom" = "vlastní";
"Select
custom
presets" = "Vybrat
vlastní
předvolby";
"Select
bundled
presets" = "Vybrat
zabudované
předvolby";
"Themes:
%s" = "Témata:
%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Přehrát hudbu v Modizer";
"Start random playlist in Modizer" = "Spustit náhodný playlist v Modizer";
"Play favorites in Modizer" = "Přehrát oblíbené v Modizer";
"Start favorites playlist in Modizer" = "Spustit playlist oblíbených v Modizer";
"Play most played in Modizer" = "Přehrát nejhranější v Modizer";
"Start most played playlist in Modizer" = "Spustit playlist nejhranějších v Modizer";
"Play a playlist in Modizer" = "Přehrát playlist v Modizer";
"Start a playlist in Modizer" = "Spustit playlist v Modizer";
"Toggle shuffle mode in Modizer" = "Přepnout náhodný režim v Modizer";
"Change shuffle mode in Modizer" = "Změnit shuffle v Modizer";
"Change loop mode in Modizer" = "Změnit režim opakování v Modizer";
"Toggle repeat in Modizer" = "Přepnout opakování v Modizer";
"What's playing in Modizer" = "Co se přehrává v Modizer";
"Current song in Modizer" = "Aktuální skladba v Modizer";

"Voices commands aren't supported in MacOS." = "Hlasové příkazy nejsou v systému macOS podporovány.";

/* Error messages */
  "playlist_not_found_error" = "Playlist nebyl nalezen. Použijte 'Získat playlisty' pro zobrazení dostupných playlistů.";
  "playlist_empty_error" = "Tento playlist neobsahuje žádné skladby. Přidejte nejprve hudbu.";

"%@ (name)" = "%@ (název)";
  "%@ (packs)" = "%@ (balíčky)";
  "%@ (rating)" = "%@ (hodnocení)";
  "2D Spectrum settings" = "Nastavení 2D spektra";
  "3D landscape settings" = "Nastavení 3D krajiny";
  "3D spectrum settings" = "Nastavení 3D spektra";
  "Auto\nscaling" = "Automatické\nškálování";
  "BG\nopacity" = "Průhlednost\npozadí";
  "Blend\npresets" = "Předvolby\nprolínání";
  "Bloom:\n%s" = "Záře:\n%s";
  "Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Procházejte a streamujte z 
  online katalogů a doplňte své sbírky.\nSnadno vytvářejte, upravujte a poslouchejte playlisty.";
  "Bundled\npresets" = "Přibalené\npředvolby";
  "CGSC collection" = "Kolekce CGSC";
  "Cleaning DB & \nreseting settings" = "Čištění DB a\nobnovení nastavení";
  "Clear\nall" = "Vymazat\nvše";
  "Close FX\nwindow" = "Zavřít okno\nFX";
  "CoverLibraryFolder" = "Jako obal aktuální složky knihovny";
  "Custom\npresets" = "Vlastní\npředvolby";
  "FX\nalpha" = "Průhlednost\nFX";
  "Feeling lucky" = "Zkusím štěstí";
  "Font size\n%s" = "Velikost písma\n%s";
  "Font:\n%s" = "Písmo:\n%s";
  "Hide MIDI & Piano FX" = "Skrýt FX MIDI a Piano";
  "Hide other note based FX if displayed (Piano, Midi)" = "Skrýt ostatní FX založené na notách, pokud jsou zobrazeny (Piano, Midi)";
  "If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Pokud se vám      
  aplikace líbí, spropitné je skvělý způsob, jak podpořit její vývoj.\nDěkujeme, že pomáháte udržovat Modizer živý a rozvíjející se.";
  "Info HUD:\n%s" = "Info HUD:\n%s";
  "JoshW Covers" = "Obaly JoshW";
  "Limit applied in Radio mode to avoid downloading too big files." = "Limit použitý v režimu Rádio, aby se zabránilo stahování příliš velkých souborů.";
  "MIDI pattern settings" = "Nastavení MIDI vzoru";
  "MOD Pattern settings" = "Nastavení MOD vzoru";
  "Made with passion,\noffered for free." = "Vytvořeno s vášní,\nnabízeno zdarma.";
  "Next: %@" = "Další: %@";
  "Next: loading..." = "Další: načítání...";
  "Octaves\nlabels" = "Popisky\noktáv";
  "Piano 3D settings" = "Nastavení 3D klavíru";
  "Piano roll settings" = "Nastavení piano roll";
  "Radio download limit" = "Limit stahování rádia";
  "Radio mode" = "Režim rádio";
  "Remove\nlisted" = "Odstranit\nvybrané";
  "Select\nall" = "Vybrat\nvše";
  "Select\nbundled\npresets" = "Vybrat\npřibalené\npředvolby";
  "Select\ncustom\npresets" = "Vybrat\nvlastní\npředvolby";
  "Select\nlisted" = "Vybrat\nvypsané";
  "Show name\ntemp." = "Zobrazit název\ndočasně";
  "Themes:\n%s" = "Motivy:\n%s";
  "Thickness:\n%s" = "Tloušťka:\n%s";
  "Try to download covers from TGDB or MobyGames." = "Zkusit stáhnout obaly z TGDB nebo MobyGames.";
  "Voices\nlabels" = "Popisky\nhlasů";
  "Volume\nbars" = "Ukazatele\nhlasitosti";
  "Welcome to Modizer!\n" = "Vítejte v Modizeru!\n";
  "Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Vaše   
  brána k retro a tracker hudbě.\nNabijte své zařízení legendárními herními melodiemi, ikonickými tracker moduly a nadčasovou chiptune klasikou.";

/* Cloud */
  "Add Cloud Source" = "Přidat cloudový zdroj";
  "Browse iCloud, Dropbox, ..." = "Procházet iCloud, Dropbox, ...";
  "Name this source" = "Pojmenovat tento zdroj";
  "Enter a name for this cloud folder" = "Zadejte název pro tuto cloudovou složku";
  "Cloud Folder" = "Cloudová složka";
  "Add" = "Přidat";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." = "Tato cloudová složka byla
  přidána, ale nemusí přetrvat po zavření aplikace. Někteří poskytovatelé cloudu nepodporují trvalý přístup.";
  "File cannot be downloaded.\nPlease check your internet connection." = "Soubor nelze stáhnout.\nZkontrolujte prosím připojení k internetu.";
  "Downloading from\ncloud..." = "Stahování z\ncloudu...";
  "Download timed out. Please try again later." = "Stahování vypršelo. Zkuste to prosím později.";
  "available" = "k dispozici";

"Copy" = "Kopírovat";
"Database couldn't be updated." = "Databázi se nepodařilo aktualizovat.";
"Database updated." = "Databáze aktualizována.";
"Issue %d while copying: %@.\n%@" = "Chyba %d při kopírování: %@.\n%@";
"Old database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Stará verze databáze: %d.%d. Bude aktualizována na %d.%d. Potvrďte a
počkejte.";
"Use STIL data" = "Použít STIL data";
"Used for subsongs titles and related artists names." = "Používá se pro názvy podskladeb a jména souvisejících umělců.";

